## Handling Missing Values

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sn

In [13]:
df = pd.read_csv('Churn_Modelling.csv', index_col='RowNumber')

In [14]:
df

,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
RowNumber,,,,,,,,,,,,,
1,15634602,Hargrave,619,France,Female,42.0,2,0.00,1,1,1,101348.88,1
2,15647311,Hill,608,Spain,Female,41.0,1,83807.86,1,0,1,112542.58,0
3,15619304,Onio,502,France,Female,42.0,8,159660.80,3,1,0,113931.57,1
4,15701354,Boni,699,France,Female,39.0,1,0.00,2,0,0,93826.63,0
5,15737888,Mitchell,850,Spain,Female,43.0,2,125510.82,1,1,1,79084.10,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
9996,15606229,Obijiaku,771,France,Male,39.0,5,0.00,2,1,0,96270.64,0
9997,15569892,Johnstone,516,France,Male,35.0,10,57369.61,1,1,1,101699.77,0
9998,15584532,Liu,709,France,Female,36.0,7,0.00,1,0,1,42085.58,1
9999,15682355,Sabbatini,772,Germany,Male,42.0,3,75075.31,2,1,0,92888.52,1
10000,15628319,Walker,792,France,Female,28.0,4,130142.79,1,1,0,38190.78,0

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10000 entries, 1 to 10000
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   CustomerId       10000 non-null  int64
 1   Surname          10000 non-null  object
 2   CreditScore      10000 non-null  int64
 3   Geography        10000 non-null  object
 4   Gender           9950 non-null   object
 5   Age              9552 non-null   float64
 6   Tenure           10000 non-null  int64
 7   Balance          10000 non-null  float64
 8   NumOfProducts    10000 non-null  int64
 9   HasCrCard        10000 non-null  int64
 10  IsActiveMember   10000 non-null  int64
 11  EstimatedSalary  10000 non-null  float64
 12  Exited           10000 non-null  int64
dtypes: float64(3), int64(7), object(3)
memory usage: 1.1+ MB

#### Gender has 50 missing values
#### Age has 448 missing values

#### The second way of finding whether we have null values in the data is by using the isnull() function.

In [16]:
print(df.isnull().sum())

CustomerId           0
Surname              0
CreditScore          0
Geography            0
Gender              50
Age                448
Tenure               0
Balance              0
NumOfProducts        0
HasCrCard            0
IsActiveMember       0
EstimatedSalary      0
Exited               0
dtype: int64

#### Handling Missing Values

##### 1. Deleting the columns with missing data

In [17]:
new_df = df.dropna(axis = 1)

In [18]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10000 entries, 1 to 10000
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   CustomerId       10000 non-null  int64
 1   Surname          10000 non-null  object
 2   CreditScore      10000 non-null  int64
 3   Geography        10000 non-null  object
 4   Tenure           10000 non-null  int64
 5   Balance          10000 non-null  float64
 6   NumOfProducts    10000 non-null  int64
 7   HasCrCard        10000 non-null  int64
 8   IsActiveMember   10000 non-null  int64
 9   EstimatedSalary  10000 non-null  float64
 10  Exited           10000 non-null  int64
dtypes: float64(2), int64(7), object(2)
memory usage: 937.5+ KB

The problem with this method is that we may lose valuable information on that feature, as we have deleted it completely due to some null values.

Should only be used if there are too many null values.

##### 2. Deleting the rows with missing data

In [19]:
new_df = df.dropna(axis=0)

In [20]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9502 entries, 1 to 10000
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   CustomerId       9502 non-null   int64
 1   Surname          9502 non-null   object
 2   CreditScore      9502 non-null   int64
 3   Geography        9502 non-null   object
 4   Gender           9502 non-null   object
 5   Age              9502 non-null   float64
 6   Tenure           9502 non-null   int64
 7   Balance          9502 non-null   float64
 8   NumOfProducts    9502 non-null   int64
 9   HasCrCard        9502 non-null   int64
 10  IsActiveMember   9502 non-null   int64
 11  EstimatedSalary  9502 non-null   float64
 12  Exited           9502 non-null   int64
dtypes: float64(3), int64(7), object(3)
memory usage: 1.0+ MB

In this case, there are possibilities of getting better accuracy than before. This might be because the columns contains more valuable information than we expected.

##### 3. Filling the Missing Values – Imputation

In this case, we will be filling the missing values with a certain number.

The possible ways to do this are:

Filling the missing data with the mean or median value if it’s a numerical variable.

Filling the missing data with mode if it’s a categorical value.

Filling the numerical value with 0 or -999, or some other number that will not occur in the data. This can be done so that the machine can recognize that the data is not real or is different.

Filling the categorical value with a new type for the missing values.

In [21]:
df['Age'].mean()

38.90002093802345

In [22]:
df['Age'].median()

37.0

fillna: fills the null records

dropna: drops the null records

In [23]:
updated_df = df

In [24]:
updated_df['Age'] = updated_df['Age'].fillna(df['Age'].mean())

In [25]:
updated_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10000 entries, 1 to 10000
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   CustomerId       10000 non-null  int64
 1   Surname          10000 non-null  object
 2   CreditScore      10000 non-null  int64
 3   Geography        10000 non-null  object
 4   Gender           9950 non-null   object
 5   Age              10000 non-null  float64
 6   Tenure           10000 non-null  int64
 7   Balance          10000 non-null  float64
 8   NumOfProducts    10000 non-null  int64
 9   HasCrCard        10000 non-null  int64
 10  IsActiveMember   10000 non-null  int64
 11  EstimatedSalary  10000 non-null  float64
 12  Exited           10000 non-null  int64
dtypes: float64(3), int64(7), object(3)
memory usage: 1.1+ MB

##### 4. Forward & Backward Filling – Imputation

In [27]:
df = pd.read_csv('Churn_Modelling.csv')

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        10000 non-null  int64
 1   CustomerId       10000 non-null  int64
 2   Surname          10000 non-null  object
 3   CreditScore      10000 non-null  int64
 4   Geography        10000 non-null  object
 5   Gender           9950 non-null   object
 6   Age              9552 non-null   float64
 7   Tenure           10000 non-null  int64
 8   Balance          10000 non-null  float64
 9   NumOfProducts    10000 non-null  int64
 10  HasCrCard        10000 non-null  int64
 11  IsActiveMember   10000 non-null  int64
 12  EstimatedSalary  10000 non-null  float64
 13  Exited           10000 non-null  int64
dtypes: float64(3), int64(8), object(3)
memory usage: 1.1+ MB

In [29]:
df1=df

In [30]:
df1['Age'] = df1['Age'].bfill()

In [31]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        10000 non-null  int64
 1   CustomerId       10000 non-null  int64
 2   Surname          10000 non-null  object
 3   CreditScore      10000 non-null  int64
 4   Geography        10000 non-null  object
 5   Gender           9950 non-null   object
 6   Age              10000 non-null  float64
 7   Tenure           10000 non-null  int64
 8   Balance          10000 non-null  float64
 9   NumOfProducts    10000 non-null  int64
 10  HasCrCard        10000 non-null  int64
 11  IsActiveMember   10000 non-null  int64
 12  EstimatedSalary  10000 non-null  float64
 13  Exited           10000 non-null  int64
dtypes: float64(3), int64(8), object(3)
memory usage: 1.1+ MB